/*
Треугольник существует только тогда, когда сумма любых двух его
сторон больше третьей. Дано: a, b, c – стороны предполагаемого
треугольника. Напишите программу которая укажет существует такой
треугольник или нет.
 */
package Java_00_Extra;

import java.util.Scanner;

public class Task3_4 {
    public static void main(String []args){
        Scanner sc = new Scanner(System.in);
        System.out.println("Введите длину первой стороны треугольника:");
        int a = sc.nextInt();
        System.out.println("Введите длину второй стороны треугольника:");
        int b = sc.nextInt();
        System.out.println("Введите длину первой стороны треугольника:");
        int c = sc.nextInt();


    }
}
